Revit 2027 API
AnalyticalPanel.Thickness Property
 Panel thickness, in the Revit default units.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Thickness { get; set; }
Public Property Thickness As Double
	Get
	Set
public:
property double Thickness {
	double get ();
	void set (double value);
}
member Thickness : float with get, set
Property Value
Double
See Also
Reference
AnalyticalPanel Class
Autodesk.Revit.DB.Structure Namespace